//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.03
//    Bug Fix : Based upon "Purley_Setup_Mapping_Language_Draft_20170413_Joe.xlsx" 
//              and "X11_Purley_BIOS_Setup_Template_With_Mapping_Language_Draft_20170413_Joe.xlsx" 
//              to distinguish between "STR_SMC_ONBOARD_LAN_1_SELECT" and "STR_SMC_ONBOARD_LAN_1_10G_SELECT".
//    Reason  : Bug Fixed
//    Auditor : Joe Jhang
//    Date    : Apr/13/2017
//
//  Rev. 1.02
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//  Rev. 1.01
//    Bug Fix:  Draft template.
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Nov/04/2016
//
//  Rev. 1.00
//    Bug Fix:  Add setup item to conrol COM2 for SOL or Uart
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Jun/14/2016
//
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <AST2500Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_AST2500_SIO_FORM                        #language eng "Super IO Configuration"	//SMCPKG_SUPPORT
#string STR_AST2500_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_AST2500_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_AST2500                                 #language eng "AST2500"

//
//Serial 1/2/3/4 Settings
//
//Below are possible resource setting for all serial port
#string STR_AST2500_SERIAL_IO3E8_IRQ7               #language eng "IO=3E8h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2E8_IRQ7               #language eng "IO=2E8h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2F0_IRQ7               #language eng "IO=2F0h; IRQ=7;"
#string STR_AST2500_SERIAL_IO2E0_IRQ7               #language eng "IO=2E0h; IRQ=7;"
#string STR_AST2500_SERIAL_IO3E8_IRQX               #language eng "IO=3E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2E8_IRQX               #language eng "IO=2E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2F0_IRQX               #language eng "IO=2F0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2500_SERIAL_IO2E0_IRQX               #language eng "IO=2E0h; IRQ=3,4,5,6,7,9,10,11,12;"

#string STR_AST2500_SERIAL6_MODE1                   #language eng "Disable IR1 function"
#string STR_AST2500_SERIAL6_MODE2                   #language eng "Enable IR1 function, active pulse 1.6uS"
#string STR_AST2500_SERIAL6_MODE3                   #language eng "Enable IR1 function, active pulse 3/16 bit time"

//
//COMB Settings
//
//#string STR_AST2500_COMB_MODE1                      #language eng "Standard Serial Port Mode"
//#string STR_AST2500_COMB_MODE2                      #language eng "IrDA Active pulse 1.6 uS"
//#string STR_AST2500_COMB_MODE3                      #language eng "IrDA Active pulse 3/16 bit time"
//#string STR_AST2500_COMB_MODE4                      #language eng "ASKIR Mode"

#string STR_UART2_MODE                              #language eng "Serial Port 2 Attribute"
                                                    #language x-AMI "SMCBL0D1" //SMCPKG_SUPPORT
#string STR_SOL                                     #language eng "SOL"
#string STR_COM                                     #language eng "COM"
#string STR_UART2_MODE_HELP                         #language eng "Select serial port 2 mode" 

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
